[{"id":1,"title":"Facebook owner Meta expected to announce major job losses","image":"https://ichef.bbci.co.uk/news/976/cpsprodpb/5978/production/_127540922_gettyimages-1368412925.jpg.webp","desc":" Facebook's parent company Meta is reportedly planning to begin large-scale lay-offs this week that will affect thousands of employees.\r\n\r\nUS media reported at ","detail":" Facebook's parent company Meta is reportedly planning to begin large-scale lay-offs this week that will affect thousands of employees.\r\n\r\nUS media reported at the weekend that the job cuts could be announced as early as Wednesday.\r\n\r\nDuring Meta's disappointing third quarter results, chief executive Mark Zuckerberg said staffing might fall."},{"id":2,"title":"Twitter chaos after wave of blue tick impersonations","image":"https://ichef.bbci.co.uk/news/976/cpsprodpb/5B69/production/_127610432_gettyimages-1244636483.jpg.webp","desc":" A wave of new paid blue tick accounts impersonating influential individuals and brands has led to chaos and confusion on Twitter.\r\n\r\nFake \"verified\" accounts i","detail":" A wave of new paid blue tick accounts impersonating influential individuals and brands has led to chaos and confusion on Twitter.\r\n\r\nFake \"verified\" accounts in the names of politicians, celebrities, major organisations and businesses started appearing on the platform on Thursday.\r\n\r\nTwitter suspended many of them, but the company's rapidly changing attempts to address the issue added to the confusion.\r\n\r\nExperts had previously warned that the new Twitter Blue subscription service announced by new chief Elon Musk, which allows users to pay £6.99 ($7.99) per month for a blue tick, would be immediately exploited by bad actors and scammers, and erode trust in the platform.\r\n\r\nThe extent of the problem with new fake blue tick accounts was laid bare after the feature launched on Wednesday.\r\n\r\nBlue tick versions of major brand accounts such as Apple, Nintendo, BP and Chiquita were suspended. Fake accounts posing as high-profile individuals like Meta chief Mark Zuckerberg, current and former US Presidents Joe Biden, Donald Trump and George W Bush, and former UK Prime Minister Tony Blair were also removed.\r\n\r\nIn one case, an account in the name of Republican candidate for Arizona governor Kari Lake tweeted to announce she was conceding to her Democratic opponent, despite the fact votes are still being counted in the tight race. It took hours for Twitter to remove the tweet and the fake account.\r\n\r\nSo this is all going well still. Did Kari Lake concede in Arizona? Nope, it's an $8 fake blue check. Been live nearly 8 hours at time of posting (yeah, timezones) pic.twitter.com/elU9i7Y8tc\r\n\r\n— Arieh Kovler (@ariehkovler) November 11, 2022\r\nThe BBC is not responsible for the content of external sites.\r\nView original tweet on Twitter\r\nPresentational white space\r\nA fake Tesla account, another company owned by Mr Musk, joked about 9/11, while Mr Musk himself was impersonated.\r\n\r\nOne of the most disruptive accounts impersonated US pharmaceutical company Eli Lilly, and declared \"insulin is free now\".\r\n\r\nThe company had to distance itself from the fake announcement.\r\n\r\nWe apologize to those who have been served a misleading message from a fake Lilly account. Our official Twitter account is @LillyPad.\r\n\r\n— Eli Lilly and Company (@LillyPad) November 10, 2022\r\nThe BBC is not responsible for the content of external sites.\r\nView original tweet on Twitter\r\nPresentational white space\r\nThe paid blue tick system is also being exploited by conspiracy theorists and far-right activists.\r\n\r\nThe BBC has seen at least three well-known QAnon influencer accounts which have purchased blue ticks on Twitter.\r\n\r\nFar-right activists Jason Kessler and Richard Spencer, who organised the 2017 Unite the Right rally in Charlottesville, have both purchased blue ticks.\r\n\r\nTwitter had previously removed verification badges from the accounts of Mr Kessler and Mr Spencer after the violent rally five years ago.\r\n\r\nResearchers also spotted a variety of accounts with purchased blue ticks using AI generated images of fake personalities. This is a specific area of concern as such inauthentic accounts are routinely used in influence operations, at times by foreign states with the aim of influencing political events in other countries."}]